app/controllers/students_controller.rb

INSERT INTO `students` (`first_name`, `last_name`, `sex`, `phone`, `email`, `avatar`, `created_at`, `updated_at`) VALUES ('', '', '', '', '', '', '2016-09-26 09:51:29', '2016-09-26 09:51:29')
---
  def create
    @student = Student.new(student_params)

    if @student.save

SELECT  `students`.* FROM `students` WHERE `students`.`id` = 2 LIMIT 1
---
  def edit
    @student = Student.find(id_param)

SELECT  `students`.* FROM `students` WHERE `students`.`id` = 1 LIMIT 1
---
  def show
    @student = Student.find(id_param)

SELECT  `students`.* FROM `students` WHERE `students`.`id` = 1 LIMIT 1
---
  def update
    @student = Student.find(id_param)

SELECT  `students`.* FROM `students` WHERE `students`.`id` = 3 LIMIT 1
DELETE FROM `students` WHERE `students`.`id` = 3
---
  def destroy
    @student = Student.find(id_param)
    @student.destroy